Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/health/health_services/blood_and_organ_donation/index.html.txt.tmx
Source language: en
Languages: ga

source: Blood and organ donation
ga: Bronnadh orgán agus fola

source: Organ and body donation
ga: Corp agus orgáin a bhronnadh

source: Organ donation and transplantation saves many lives each year
ga: Is iomaí duine a thugtar slán gach bliain le bronnadh orgáin agus trasphlandú

source: Information about organ donation and about donating your body to science
ga: Faisnéis faoi bhronnadh orgáin agus faoi do chorp a bhronnadh le haghaidh taighde leighis

source: Blood donation services are organised by the Irish Blood Transfusion Service. Rules about donating blood
ga: Tá cur síos sa cháipéis seo ar an tSeirbhís Fhuilaistriúcháin agus na rialacha a bhaineann le fuil a dheonú

source: Hepatitis C and the Health Amendment Act Card
ga: Heipitíteas C agus an Cárta faoin Acht Sláinte (Leasú)

source: Services that are available to people who contracted Hepatitis C through the use of Human Immunoglobulin-Anti-D or through receiving blood products or blood transfusions in Ireland
ga: Tá cur síos sa cháipéis seo ar na seirbhísí atá ar fáil do dhaoine a fuair Heipitíteas C ó Ghlóbailin Imdhíonachta Daonna-Frith-D nó ó aon tháirge fola nó aistriú fola a fuair siad in Éirinn

source: Most Read in "Health"
ga: Ábhar is mó éilimh i "Sláinte"

source: Admission to a psychiatric hospital
ga: Ospidéal síciatrach a iontráil

source: Medical card means test: aged under 70
ga: Tástáil mhaoine cárta leighis: daoine faoi bhun 70 bliain d’aois
